app/services/openai_service.rb

  def generate_response(chat, user_message_content = nil)
    trimmed_messages = prepare_messages_for_api(chat)

    if trimmed_messages.empty?
      Rails.logger.warn "No messages available for chat #{chat.id} after token trimming"
      return "I'm sorry, but the conversation history is too long. Please start a new chat."
    end

    input_tokens = TokenCountingService.count_chat_tokens(trimmed_messages, model: @model)

    Rails.logger.info "Chat #{chat.id}: Sending #{input_tokens} input tokens to #{@model}"

      response = @client.chat(
        parameters: {
          model: @model,
          messages: trimmed_messages,
          temperature: ApplicationConfig.temperature(@model),
          max_tokens: calculate_max_tokens(input_tokens)
        }
      )

    if response["error"]
      handle_api_error(response["error"], chat)
    else
      content = response.dig("choices", 0, "message", "content")
      usage = response.dig("usage")

      if usage
        Rails.logger.info "Chat #{chat.id}: API returned usage - input: #{usage['prompt_tokens']}, output: #{usage['completion_tokens']}, total: #{usage['total_tokens']}"

        chat.update_column(:model_used, @model)
---
UPDATE "chats" SET "model_used" = 'gpt-4o-mini' WHERE "chats"."id" = 35

  def check_token_limits(chat)
    available_tokens = chat.total_available_tokens_for_history(@model)
    current_tokens, trimmed_messages = chat.messages_within_token_limit(@model)
    {
      model: @model,
      token_limit: ApplicationConfig.token_limit(@model),
      available_for_history: available_tokens,
      current_usage: current_tokens,
      within_limit: current_tokens <= available_tokens,
      messages_count: chat.messages.count,
      trimmed_messages_count: trimmed_messages.count
---
SELECT COUNT(*) FROM "messages" WHERE "messages"."chat_id" = 35

  def prepare_messages_for_api(chat)
    _, messages_to_send = chat.messages_within_token_limit(@model)
    openai_messages = messages_to_send.map do |message|
      {
        role: message.role,
        content: message.content
      }
    end

    total_messages = chat.messages.count
    if messages_to_send.count < total_messages
      Rails.logger.info "Chat #{chat.id}: Trimmed #{total_messages - messages_to_send.count} messages to fit token limit"
---
SELECT COUNT(*) FROM "messages" WHERE "messages"."chat_id" = 35
SELECT COUNT(*) FROM "messages" WHERE "messages"."chat_id" = 34