app/views/chats/index.html.erb

SELECT "chats".* FROM "chats" ORDER BY "chats"."updated_at" DESC
---
            <h3 class="text-lg font-semibold text-gray-900">
              <%= link_to chat.title.present? ? chat.title : "Chat ##{chat.id}", chat_path(chat), class: "hover:text-blue-600" %>

SELECT "messages".* FROM "messages" WHERE "messages"."chat_id" IN (29, 28, 27, 26, 3, 2)
SELECT COUNT(*) FROM "messages" WHERE "messages"."chat_id" = 29
---
          <div class="mt-2 text-xs text-gray-500">
            <%= pluralize(chat.messages.count, 'message') %>