app/views/chats/show.html.erb

      <div id="messages-container" class="p-4 max-h-96 overflow-y-auto space-y-4">
        <% @chat.messages.ordered.each do |message| %>
---
SELECT "messages".* FROM "messages" WHERE "messages"."chat_id" = 1 ORDER BY "messages"."created_at" ASC


        <% if @chat.messages.empty? %>
---
SELECT 1 AS one FROM "messages" WHERE "messages"."chat_id" = 1 LIMIT 1