app/controllers/chats_controller.rb

  def index
    @chats = Chat.recent.includes(:messages)
---
SELECT "chats".* FROM "chats" ORDER BY "chats"."updated_at" DESC
SELECT "messages".* FROM "messages" WHERE "messages"."chat_id" = 3 ORDER BY "messages"."created_at" DESC LIMIT 1

  def create
    @chat = Chat.new(chat_params)

    if @chat.save
---
INSERT INTO "chats" ("title", "created_at", "updated_at", "total_input_tokens", "total_output_tokens", "total_tokens", "model_used") VALUES ('USA information', '2025-09-08 11:02:22.056497', '2025-09-08 11:02:22.056497', NULL, NULL, NULL, NULL) RETURNING "id"

  def find_chat
    @chat = Chat.find(params[:id])
---
SELECT "chats".* FROM "chats" WHERE "chats"."id" = 1 LIMIT 1