app/controllers/messages_controller.rb

INSERT INTO "messages" ("chat_id", "content", "role", "created_at", "updated_at", "input_tokens", "output_tokens", "total_tokens") VALUES (29, 'Hi', 'user', '2025-09-08 10:58:10.650911', '2025-09-08 10:58:10.650911', NULL, NULL, NULL) RETURNING "id"
INSERT INTO "messages" ("chat_id", "content", "role", "created_at", "updated_at", "input_tokens", "output_tokens", "total_tokens") VALUES (34, 'I''m sorry, I''m having trouble processing your request right now. Please try again later.', 'assistant', '2025-09-08 14:52:49.850179', '2025-09-08 14:52:49.850179', NULL, NULL, NULL) RETURNING "id"
SELECT COUNT(*) FROM "messages" WHERE "messages"."chat_id" = 34
---
  def create
    @message = @chat.messages.build(message_params.merge(role: 'user'))

    if @message.save
      ai_response = generate_ai_response

      if ai_response
        if ai_response.is_a?(Hash)
          response_content = ai_response[:content]
          usage_info = ai_response[:usage]
        else
          response_content = ai_response
          usage_info = nil
        end

        ai_message = @chat.messages.create!(
          content: response_content,
          role: 'assistant'
        )

        # Update token usage for both messages if we have usage info
        if usage_info
          update_message_tokens(@message, ai_message, usage_info)
        end

        # Update chat title if it's the first message
        update_chat_title if @chat.messages.count == 2

SELECT "chats".* FROM "chats" WHERE "chats"."id" = 34 LIMIT 1
---
  def find_chat
    @chat = Chat.find(params[:chat_id])

UPDATE "messages" SET "input_tokens" = 1, "output_tokens" = 0, "total_tokens" = 1 WHERE "messages"."id" = 89
UPDATE "messages" SET "input_tokens" = 0, "output_tokens" = 9, "total_tokens" = 9 WHERE "messages"."id" = 86
---
  def update_message_tokens(user_message, assistant_message, usage_info)
    return unless usage_info

    current_model = ApplicationConfig.current_model

    user_input_tokens = TokenCountingService.count_message_tokens(
      user_message.content,
      model: current_model
    )

    user_message.update_columns(
      input_tokens: user_input_tokens,
      output_tokens: 0,
      total_tokens: user_input_tokens
    )

    assistant_message.update_columns(
      input_tokens: 0,
      output_tokens: usage_info[:output_tokens],
      total_tokens: usage_info[:output_tokens]
    )

UPDATE "chats" SET "title" = 'Whatsup', "updated_at" = '2025-09-08 15:18:45.396749' WHERE "chats"."id" = 36
---
  def update_chat_title
    first_message_content = @chat.messages.by_user.first.content
    title = first_message_content.truncate(50, omission: '...')
    @chat.update(title: title)