app/controllers/usage_controller.rb

  def index
    @usage_stats = {
      total_chats: Chat.count,
      total_messages: Message.count,
      total_tokens: Chat.sum(:total_tokens) || 0,
      total_input_tokens: Chat.sum(:total_input_tokens) || 0,
      total_output_tokens: Chat.sum(:total_output_tokens) || 0,
      today: daily_usage_stats(Date.current),
      this_month: monthly_usage_stats(Date.current.beginning_of_month),
      models_used: model_usage_stats,
      cost_estimates: calculate_total_costs
---
SELECT COUNT(*) FROM "messages"
SELECT SUM("chats"."total_output_tokens") FROM "chats"

  def top_chats
    limit = params[:limit]&.to_i || 10

    @top_chats = Chat.joins(:messages)
                    .where.not(total_tokens: nil)
                    .order(total_tokens: :desc)
                    .limit(limit)
                    .includes(:messages)
                    .map do |chat|
      openai_service = OpenaiService.new
      {
        id: chat.id,
        title: chat.title || "Chat #{chat.id}",
        total_tokens: chat.total_tokens || 0,
        total_input_tokens: chat.total_input_tokens || 0,
        total_output_tokens: chat.total_output_tokens || 0,
        messages_count: chat.messages.count,
        model_used: chat.model_used || ApplicationConfig.current_model,
        cost_estimate: openai_service.estimate_cost(chat),
        created_at: chat.created_at,
        last_activity: chat.updated_at
---
SELECT DISTINCT "chats"."id" FROM "chats" INNER JOIN "messages" ON "messages"."chat_id" = "chats"."id" WHERE "chats"."total_tokens" IS NOT NULL ORDER BY "chats"."total_tokens" DESC LIMIT 10
SELECT COUNT(*) FROM "messages" WHERE "messages"."chat_id" = 29

  def daily_usage_stats(date)
    messages_today = Message.where(
      created_at: date.beginning_of_day..date.end_of_day
    )

    chats_today = Chat.joins(:messages).where(
      messages: { created_at: date.beginning_of_day..date.end_of_day }
    ).distinct

    {
      messages_count: messages_today.count,
      chats_count: chats_today.count,
      total_tokens: messages_today.sum(:total_tokens) || 0,
      input_tokens: messages_today.sum(:input_tokens) || 0,
      output_tokens: messages_today.sum(:output_tokens) || 0,
      cost_estimate: calculate_daily_cost(date)
---
SELECT COUNT(DISTINCT "chats"."id") FROM "chats" INNER JOIN "messages" ON "messages"."chat_id" = "chats"."id" WHERE "messages"."created_at" BETWEEN '2025-09-08 00:00:00' AND '2025-09-08 23:59:59.999999'
SELECT SUM("messages"."output_tokens") FROM "messages" WHERE "messages"."created_at" BETWEEN '2025-09-08 00:00:00' AND '2025-09-08 23:59:59.999999'

  def monthly_usage_stats(month)
    messages_month = Message.where(
      created_at: month..month.end_of_month
    )

    chats_month = Chat.joins(:messages).where(
      messages: { created_at: month..month.end_of_month }
    ).distinct

    {
      messages_count: messages_month.count,
      chats_count: chats_month.count,
      total_tokens: messages_month.sum(:total_tokens) || 0,
      input_tokens: messages_month.sum(:input_tokens) || 0,
      output_tokens: messages_month.sum(:output_tokens) || 0,
      cost_estimate: calculate_monthly_cost(month)
---
SELECT COUNT(DISTINCT "chats"."id") FROM "chats" INNER JOIN "messages" ON "messages"."chat_id" = "chats"."id" WHERE "messages"."created_at" BETWEEN '2025-09-01' AND '2025-09-30'
SELECT SUM("messages"."output_tokens") FROM "messages" WHERE "messages"."created_at" BETWEEN '2025-09-01' AND '2025-09-30'

  def model_usage_stats
    Chat.where.not(model_used: nil)
        .group(:model_used)
        .count
---
SELECT COUNT(*) AS "count_all", "chats"."model_used" AS "chats_model_used" FROM "chats" WHERE "chats"."model_used" IS NOT NULL GROUP BY "chats"."model_used"

  def calculate_total_costs
    total_input = Chat.sum(:total_input_tokens) || 0
    total_output = Chat.sum(:total_output_tokens) || 0
---
SELECT SUM("chats"."total_input_tokens") FROM "chats"
SELECT SUM("chats"."total_output_tokens") FROM "chats"

  def calculate_daily_cost(date)
    messages_today = Message.where(
      created_at: date.beginning_of_day..date.end_of_day
    )

    input_tokens = messages_today.sum(:input_tokens) || 0
    output_tokens = messages_today.sum(:output_tokens) || 0
---
SELECT SUM("messages"."input_tokens") FROM "messages" WHERE "messages"."created_at" BETWEEN '2025-09-08 00:00:00' AND '2025-09-08 23:59:59.999999'
SELECT SUM("messages"."output_tokens") FROM "messages" WHERE "messages"."created_at" BETWEEN '2025-09-08 00:00:00' AND '2025-09-08 23:59:59.999999'

  def calculate_monthly_cost(month)
    messages_month = Message.where(
      created_at: month..month.end_of_month
    )

    input_tokens = messages_month.sum(:input_tokens) || 0
    output_tokens = messages_month.sum(:output_tokens) || 0
---
SELECT SUM("messages"."input_tokens") FROM "messages" WHERE "messages"."created_at" BETWEEN '2025-09-01' AND '2025-09-30'
SELECT SUM("messages"."output_tokens") FROM "messages" WHERE "messages"."created_at" BETWEEN '2025-09-01' AND '2025-09-30'