app/models/chat.rb

  def update_token_totals
    input_total = messages.sum(:input_tokens) || 0
    output_total = messages.sum(:output_tokens) || 0

    self.update_columns(
      total_input_tokens: input_total,
      total_output_tokens: output_total,
      total_tokens: input_total + output_total
    )
---
UPDATE "chats" SET "total_input_tokens" = 2, "total_output_tokens" = 9, "total_tokens" = 11 WHERE "chats"."id" = 35