app/models/message.rb

  def update_token_usage(model: 'gpt-3.5-turbo')
    token_count = calculate_token_count(model: model)

    if role == 'user'
      self.update_columns(
        input_tokens: token_count,
        output_tokens: 0,
        total_tokens: token_count
      )
    else # assistant
      self.update_columns(
        input_tokens: 0,
        output_tokens: token_count,
        total_tokens: token_count
      )
---
UPDATE "messages" SET "input_tokens" = 1, "output_tokens" = 0, "total_tokens" = 1 WHERE "messages"."id" = 39
UPDATE "messages" SET "input_tokens" = 0, "output_tokens" = 20, "total_tokens" = 20 WHERE "messages"."id" = 40